{
  [
    {
      "sum": "Proficient in <b>Python programming</b> with a strong foundation in essential libraries including <b>('</b>xlrd, pandas, and MySQL <b>')</b>for data manipulation and analysis."
    },
    {
      "sum": "Experienced in developing Telegram bots using <b>telegram.ext</b> framework, with a notable achievement of creating a personalized bot capable of efficiently retrieving images from an album based on user requests."
    },
    {
      "sum": "Eager to contribute these skills to projects that require <b>data handling</b> and interactive bot development."
    },
    {
      "sum": "Demonstrated expertise in running a JavaScript runtime environment called <b>Node.js</b>, along with its fundamental libraries such as <b>('</b> node-scheduler, cors, jsonwebtoken, cookie-parser, and body-parser <b>')</b>."
    },
    {
      "sum": "Possess excellent proficiency in utilizing <b>Express.js </b> in conjunction with Node.js to establish backend server-side responses."
    },
    {
      "sum": "Experienced in the complete <b>software development lifecycle</b>, encompassing design, development, testing, production support, and administration."
    },
    {
      "sum": "Extensive hands-on experience in web design utilizing <b>HTML</b>, <b>CSS</b>, and <b>JavaScript</b> for client-side development"
    },
    {
      "sum": "Proficient in designing interfaces for web applications using <b>Figma</b>."
    },
    {
      "sum": "Solid comprehension of <b>React</b> and its core methods, including <b>('</b> props, filter, map, etc., <b>')</b>with a proven track record of working on diverse <b>API projects.</b>"
    },
    {
      "sum": "Adept at utilizing VS <b>Code</b> as the preferred development environment for project work."
    },
    {
      "sum": "Experienced in <b>interface development</b> for web applications using JavaScript."
    },
    {
      "sum": "Proficiently managed <b>SQL</b> databases, excelling in query formulation using <b>MySQL Workbench.</b> also in database creation, and database management."
    },
    {
      "sum": "Proficient in handling <b>JSON files</b> for seamless object transfer across various environments."
    },
    {
      "sum": "Demonstrated excellence in creating <b>JSON Servers</b> containing data objects."
    },
    {
      "sum": "Successfully managed concurrent projects effectively and efficiently."
    },
    {
      "sum": "Contributed to various production maintenance, Go Live, and disaster management activities."
    },
    {
      "sum": "Possesses foundational knowledge of <b>MS Excel</b>, master data integration, and <b>API management.</b>"
    }
  ]
}

